{
  "lastUpdated": "2025-09-05T02:16:53.340Z",
  "locations": {
    "richmond": {
      "totalCount": 72,
      "rating": 5,
      "displayedCount": 5
    },
    "springvale": {
      "totalCount": 16,
      "rating": 5,
      "displayedCount": 5
    }
  },
  "reviews": [
    {
      "rating": 5,
      "review": "Annie is the best at what she does. Her studio is very clean and Annie is so friendly and professional. She makes you feel so comfortable and explained everything to you as she goes. Thank you Annie for making me feel good (Richmond location)",
      "author": "Elouise Valoa",
      "date": "August 2025",
      "stars": 5,
      "source": "google",
      "verified": true,
      "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocL7Rr91ZpV0UMUhSbzNNW_97SjjMJFvpbGfem2UJ123XPLBMw=s128-c0x00000000-cc-rp-mo",
      "originalTime": 1754899673
    },
    {
      "rating": 5,
      "review": "As it was my first time visiting Anne, so now im very happy. Anne has done my eyebrows so beautiful, now I can see more changes and differences in my face.Thanks again Anne 🙂🙂❤️ (Springvale location)",
      "author": "Shahgul",
      "date": "June 2025",
      "stars": 5,
      "source": "google",
      "verified": true,
      "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjW0d_sPiMtmfu8iT1ZG9tgw0aLcxPn109-Drcyz_bkAvufuywQ=s128-c0x00000000-cc-rp-mo",
      "originalTime": 1749287901
    },
    {
      "rating": 5,
      "review": "Excellent service. The professionalism, calm, patience in your work is just A+. I had my brows done and all I can say is....WOW! This is my second treatment and will continue to go here in the future. Very happy customer right here. Thanks Ann. Regards, Socheat (Springvale location)",
      "author": "socheat sing",
      "date": "May 2025",
      "stars": 5,
      "source": "google",
      "verified": true,
      "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocIu8H9p9kd1ybVALe9lQh7lhPyLT6ucVm2NIXxDvkqaBrZtMw=s128-c0x00000000-cc-rp-mo",
      "originalTime": 1748408952
    },
    {
      "rating": 5,
      "review": "Love Anne. She is very professional and takes care of every detail of the customer..  I went to get my eyebrows tattooed at another shop and they weren't pretty. She fixed my eyebrows and they looked very beautiful. Thank you very much for recommending that I get my eyebrows tattooed at Springvale.. You will not be disappointed if you get your eyebrows tattooed with her, she will give you great advice. She loves her profession very much. Thank you so much for making my eyebrows beautiful again.anne She is a very friendly  and positive  Thanks anne (Richmond location)",
      "author": "Jessica Kim",
      "date": "May 2025",
      "stars": 5,
      "source": "google",
      "verified": true,
      "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXqIUXvkmXHmkzckchSzSjAO_749EJmcQcFIoUKqp5zzAuXrkbb=s128-c0x00000000-cc-rp-mo",
      "originalTime": 1747021965
    },
    {
      "rating": 5,
      "review": "I drove past Anne's Shop while driving past Springvale Shopping Centre. I called Anne to ask if she could help my pre-teen daughters with shaping their eyebrows. I had tried to shape them but couldn't make them even and had visited other salon's but was not happy with the service. She was friendly and accommodating and so I booked an appointment. My kids were nervous, but she was engaging and friendly and did such an amazing job with their brows! When they walked out, the difference to their faces was incredible. The shape of their brows lifted their faces, and it was done within minutes.\n\nHighly recommended Anne! She knows her craft, and I am so thankful that I found her.\n\nAA++ (Springvale location)",
      "author": "Annette Kourtis",
      "date": "December 2024",
      "stars": 5,
      "source": "google",
      "verified": true,
      "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjXlQdSkxu_gPIRLZ2GSo6NnD2-ISvpGOERv_7THEPCJMxYc7ICC4Q=s128-c0x00000000-cc-rp-mo-ba2",
      "originalTime": 1733488327
    },
    {
      "rating": 5,
      "review": "I recently had my eyebrows done by Anne. She has done an absolutely amazing job, and I feel like she has taken at least 10 years off my ‘look’. She has given my eyebrows a wonderful shape and I feel so much more confident in my appearance. In addition to being a skilled artist, Anne is warm and engaging, and I have no hesitation in recommending her. Given what she had to work with, she is absolutely brilliant, and I am so grateful to her. (Richmond location)",
      "author": "M N",
      "date": "November 2024",
      "stars": 5,
      "source": "google",
      "verified": true,
      "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocKgKyOuraHxsim9_gDoglmaEIGB4fF2htGtx6mdIsdfWb7mPw=s128-c0x00000000-cc-rp-mo",
      "originalTime": 1731965086
    },
    {
      "rating": 5,
      "review": "Would definitely recommend to anyone wanting to get their eyebrows microbladed but don't know what to expect.\n\nI was unsure of how my eyebrows should be shaped so I took Anne's professional advice and was happy with the first draft she drew. Anne will sit you down and make you comfortable before anything goes permanent. I also splurged and got my eyelash extensions done at the same time! I was surprised how fast and efficient she is.\n\nAnne is 10/10 amazing, friendly and professional. She is very honest in her work and takes pride in what she does. (Springvale location)",
      "author": "Rackles",
      "date": "June 2024",
      "stars": 5,
      "source": "google",
      "verified": true,
      "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocJlVMb4MBcRjWG9ewrANPQV3QXdzmD2X38NeMSh2tY8Kd5kTw=s128-c0x00000000-cc-rp-mo",
      "originalTime": 1718631582
    },
    {
      "rating": 5,
      "review": "Anne is gorgeous, she has been so patient with me throughout my eyebrow microblading journey. I have not been one to invest in my appearance from a cosmetic perspective and had expected something as drastic as a face tattoo would be quite daunting but Anne ensured it was quite the opposite. She stepped me through each stage at a pace and style I was comfortable with. I have just been for a 12 month touch up and its like catching up with an old friend with a side of eyebrow perfection. Cannot recommend highly enough. (Richmond location)",
      "author": "Leah Cole",
      "date": "May 2024",
      "stars": 5,
      "source": "google",
      "verified": true,
      "profilePhoto": "https://lh3.googleusercontent.com/a-/ALV-UjV7RjF8BR0Ug2MVSPdgjhSeRF2HcLO0G3-BY7LH3D_pR5WmT_c=s128-c0x00000000-cc-rp-mo-ba3",
      "originalTime": 1715490108
    },
    {
      "rating": 5,
      "review": "Had my first saline removal with Anne today,  made me feel extremely welcome, so patient and professional. Anne explained every detail to me about whats best for my brows removal and ensuring I’m comfortable to proceed. Highly recommend her work, her clinic has an amazing atmosphere ,clean and tidy as well as very professional. I will definitely be back and I highly recommend! 🥰 (Springvale location)",
      "author": "Ann L",
      "date": "February 2023",
      "stars": 5,
      "source": "google",
      "verified": true,
      "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocLr9k7AvinDrrErKGxUog1L4YuBPxiXadgepOZ9hsE6jmm_Cw=s128-c0x00000000-cc-rp-mo",
      "originalTime": 1675645439
    },
    {
      "rating": 5,
      "review": "Absolutely amazing experience! Anne is fabulous. I have been very insecure about my eyebrows for years and finally decided to get microblading done. Anne talked me through everything and told me what she would recommend. She made my brows even, a lovely arch, full and designed everything to match my face shape and enhance it. This is hands done the best thing I have decided to do. Anne has boosted my confidence. I honestly can’t wait to see her again. Highly recommended!! (Richmond location)",
      "author": "Racquel MacSweeney",
      "date": "January 2023",
      "stars": 5,
      "source": "google",
      "verified": true,
      "profilePhoto": "https://lh3.googleusercontent.com/a/ACg8ocK__cpvjFBopOyGs0H7orkKa6-ZrEfERxg8G4QwBEGOSc-Vug=s128-c0x00000000-cc-rp-mo",
      "originalTime": 1673994842
    }
  ],
  "totals": {
    "totalReviewsOnGoogle": 88,
    "totalReviewsDisplayed": 10,
    "averageRating": "5.0"
  }
}